tsung/data/server-side-caching/view-and-search/view-and-search.xml
<?xml version="1.0"?><tsung loglevel="notice" version="1.0">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
    <server host="35.165.100.214" port="80" type="tcp"/>
  </servers>


  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
   <arrivalphase phase="4" duration="30" unit="second">
     <users arrivalrate="8" unit="second"/>
   </arrivalphase>
   </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
 

    <session name="view-and-search" probability="100" type="ts_http">


      <setdynvars sourcetype="random_number" start="1" end="5">
        <var name="random_tournament_number"/>
      </setdynvars>

      <setdynvars sourcetype="random_number" start="42" end="89">
        <var name="random_match_number"/>
      </setdynvars>

      <setdynvars sourcetype="random_number" start="1" end="10">
        <var name="random_club_number"/>
      </setdynvars>

      <setdynvars sourcetype="random_number" start="1" end="200">
        <var name="random_player_number"/>
      </setdynvars>
      <request subst="true">
        <http url="/tournaments/%%_random_tournament_number%%" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url="/matches/%%_random_match_number%%" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url="/clubs/%%_random_club_number%%" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url="/players/%%_random_player_number%%" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>
      <request subst="true">
        <http url="/tournaments/%%_random_tournament_number%%" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url="/matches/%%_random_match_number%%" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url="/clubs/%%_random_club_number%%" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url="/players/%%_random_player_number%%" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>
      <request subst="true">
        <http url="/tournaments/%%_random_tournament_number%%" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url="/matches/%%_random_match_number%%" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url="/clubs/%%_random_club_number%%" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url="/players/%%_random_player_number%%" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>
      <request>
        <http url="/players?utf8=%E2%9C%93&amp;search=Julie&amp;commit=Search" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>
      <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->         io:format([126, $p, 126, $n, 126, $n], [DynVars]),         ok end.">
        <var name="dump"/>
      </setdynvars>

    </session>

  </sessions>
</tsung>